profiling/wallet-profile-report-20260522-194616/statistics.json
{
  "POST hold" : {
    "transaction" : "POST hold",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 65.09800000000008,
    "medianResTime" : 54.5,
    "minResTime" : 15.0,
    "maxResTime" : 479.0,
    "pct1ResTime" : 108.89999999999998,
    "pct2ResTime" : 134.94999999999993,
    "pct3ResTime" : 460.0,
    "throughput" : 115.63367252543941,
    "receivedKBytesPerSec" : 27.892106556429233,
    "sentKBytesPerSec" : 29.799497535557354
  },
  "POST release" : {
    "transaction" : "POST release",
    "sampleCount" : 1000,
    "errorCount" : 895,
    "errorPct" : 89.5,
    "meanResTime" : 40.39899999999992,
    "medianResTime" : 33.0,
    "minResTime" : 10.0,
    "maxResTime" : 185.0,
    "pct1ResTime" : 73.89999999999998,
    "pct2ResTime" : 93.94999999999993,
    "pct3ResTime" : 131.97000000000003,
    "throughput" : 121.96609342602756,
    "receivedKBytesPerSec" : 717.7936857772289,
    "sentKBytesPerSec" : 32.14556939108428
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 895,
    "errorPct" : 29.833334,
    "meanResTime" : 43.90366666666663,
    "medianResTime" : 32.0,
    "minResTime" : 5.0,
    "maxResTime" : 479.0,
    "pct1ResTime" : 85.0,
    "pct2ResTime" : 105.94999999999982,
    "pct3ResTime" : 168.98999999999978,
    "throughput" : 330.0693145560568,
    "receivedKBytesPerSec" : 710.1611064886126,
    "sentKBytesPerSec" : 75.60467581004511
  },
  "GET wallet" : {
    "transaction" : "GET wallet",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.214000000000013,
    "medianResTime" : 18.0,
    "minResTime" : 5.0,
    "maxResTime" : 422.0,
    "pct1ResTime" : 41.0,
    "pct2ResTime" : 51.94999999999993,
    "pct3ResTime" : 246.3500000000006,
    "throughput" : 110.37527593818984,
    "receivedKBytesPerSec" : 36.23100769177704,
    "sentKBytesPerSec" : 18.311624758554082
  }
}