profiling/wallet-profile-report-20260522-195457/statistics.json
{
  "POST hold" : {
    "transaction" : "POST hold",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107.88599999999995,
    "medianResTime" : 89.0,
    "minResTime" : 19.0,
    "maxResTime" : 764.0,
    "pct1ResTime" : 176.89999999999998,
    "pct2ResTime" : 239.89999999999986,
    "pct3ResTime" : 755.6200000000031,
    "throughput" : 100.5631536604988,
    "receivedKBytesPerSec" : 24.256932572405468,
    "sentKBytesPerSec" : 25.916421020213193
  },
  "POST release" : {
    "transaction" : "POST release",
    "sampleCount" : 1000,
    "errorCount" : 797,
    "errorPct" : 79.7,
    "meanResTime" : 78.36200000000005,
    "medianResTime" : 64.0,
    "minResTime" : 13.0,
    "maxResTime" : 404.0,
    "pct1ResTime" : 138.89999999999998,
    "pct2ResTime" : 197.0,
    "pct3ResTime" : 283.9000000000001,
    "throughput" : 108.74293170943888,
    "receivedKBytesPerSec" : 572.8162422860484,
    "sentKBytesPerSec" : 28.661514687092215
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 797,
    "errorPct" : 26.566668,
    "meanResTime" : 76.33666666666637,
    "medianResTime" : 62.0,
    "minResTime" : 7.0,
    "maxResTime" : 764.0,
    "pct1ResTime" : 136.0,
    "pct2ResTime" : 184.94999999999982,
    "pct3ResTime" : 292.9899999999998,
    "throughput" : 297.91459781529295,
    "receivedKBytesPerSec" : 579.6679105635551,
    "sentKBytesPerSec" : 68.24183838133068
  },
  "GET wallet" : {
    "transaction" : "GET wallet",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42.76199999999997,
    "medianResTime" : 34.0,
    "minResTime" : 7.0,
    "maxResTime" : 270.0,
    "pct1ResTime" : 77.89999999999998,
    "pct2ResTime" : 101.89999999999986,
    "pct3ResTime" : 154.98000000000002,
    "throughput" : 99.6710854181202,
    "receivedKBytesPerSec" : 32.73465143152597,
    "sentKBytesPerSec" : 16.536542690371775
  }
}