profiling/wallet-profile-report-20260522-202824/statistics.json
{
  "POST hold" : {
    "transaction" : "POST hold",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.48600000000003,
    "medianResTime" : 48.0,
    "minResTime" : 10.0,
    "maxResTime" : 477.0,
    "pct1ResTime" : 116.0,
    "pct2ResTime" : 145.0,
    "pct3ResTime" : 431.9100000000001,
    "throughput" : 119.88970147464333,
    "receivedKBytesPerSec" : 28.918707289293852,
    "sentKBytesPerSec" : 30.897824001918238
  },
  "POST release" : {
    "transaction" : "POST release",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 53.261999999999986,
    "medianResTime" : 46.0,
    "minResTime" : 9.0,
    "maxResTime" : 313.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 135.0,
    "pct3ResTime" : 233.84000000000015,
    "throughput" : 126.31047113805735,
    "receivedKBytesPerSec" : 30.96086743716054,
    "sentKBytesPerSec" : 33.29267715043577
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.93833333333329,
    "medianResTime" : 33.0,
    "minResTime" : 4.0,
    "maxResTime" : 477.0,
    "pct1ResTime" : 94.0,
    "pct2ResTime" : 125.0,
    "pct3ResTime" : 242.9499999999989,
    "throughput" : 354.10764872521247,
    "receivedKBytesPerSec" : 96.17826553647309,
    "sentKBytesPerSec" : 81.11647190745987
  },
  "GET wallet" : {
    "transaction" : "GET wallet",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.06699999999997,
    "medianResTime" : 19.0,
    "minResTime" : 4.0,
    "maxResTime" : 282.0,
    "pct1ResTime" : 46.89999999999998,
    "pct2ResTime" : 60.94999999999993,
    "pct3ResTime" : 115.0,
    "throughput" : 118.31519167061052,
    "receivedKBytesPerSec" : 38.86584721071936,
    "sentKBytesPerSec" : 19.63107844297208
  }
}